Revit 2027 API
Form.GetProfileAndCurveLoopIndexFromReference Method
Given a reference to certain curve or edge, get the index of its profile and curve loop respectively.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void GetProfileAndCurveLoopIndexFromReference(
	Reference curveOrEdgeReference,
	ref int profileIndex,
	ref int curveLoopIndex
)
Public Sub GetProfileAndCurveLoopIndexFromReference (
	curveOrEdgeReference As Reference,
	ByRef profileIndex As Integer,
	ByRef curveLoopIndex As Integer
)
public:
void GetProfileAndCurveLoopIndexFromReference(
	Reference^ curveOrEdgeReference,
	int% profileIndex,
	int% curveLoopIndex
)
member GetProfileAndCurveLoopIndexFromReference :
        curveOrEdgeReference : Reference *
        profileIndex : int byref *
        curveLoopIndex : int byref -> unit
Parameters
curveOrEdgeReference Reference
Reference to a curve/edge that is part of one profile
profileIndex Int32
Profile index for output
curveLoopIndex Int32
Curve loop index for output
See Also
Reference
Form Class
Autodesk.Revit.DB Namespace